In [ ]:
#Exp no,:3

In [ ]:
Aim : To Study Basic Of Data Frame

In [ ]:
#Name:Yogesh Suresh Mamankar
#Roll No:37
#Sec:B
#Subject:ET1
#Date:07/08/2025

# Creating Series

In [2]:
import pandas as pd

In [3]:
name=["yogesh","sagar","nikhil","pratik","jay"]

In [4]:
name

['yogesh', 'sagar', 'nikhil', 'pratik', 'jay']

In [6]:
Roll_list=pd.Series(name,index=[1,2,3,4,5])
print(Roll_list)

1    yogesh
2     sagar
3    nikhil
4    pratik
5       jay
dtype: object

# Creating a data frame

In [11]:
df=pd.DataFrame([[19,18,20,26],[21,23,14,25],[18,23,19,24]],
columns= ["CD","DBMS","DSS","CAO"])

In [12]:
df

   CD  DBMS  DSS  CAO
0  19    18   20   26
1  21    23   14   25
2  18    23   19   24

In [13]:
df.shape

(3, 4)

In [14]:
df.size

12

In [15]:
df.ndim

2

# Adding Record (Row) to Data Frame

In [18]:
df2=pd.DataFrame([[19,18,20,26]],
columns= ["CD","DBMS","DSS","CAO"])

In [37]:
df3=pd.concat([df,df2,df3],ignore_index=True)

In [39]:
df3

   CD  DBMS  DSS  CAO
0  19    18   20   26
1  19    18   20   26
2  19    18   20   26
3  19    18   20   26

# Adding attribute (Columns) to the Data Frame

In [42]:
df3["DM"]=[23,11,22,12]

In [43]:
df3

   CD  DBMS  DSS  CAO  DM
0  19    18   20   26  23
1  19    18   20   26  11
2  19    18   20   26  22
3  19    18   20   26  12

# Deleting record for df3 dataframe

In [44]:
df4=df3.drop(index=[1])

In [45]:
df4

   CD  DBMS  DSS  CAO  DM
0  19    18   20   26  23
2  19    18   20   26  22
3  19    18   20   26  12

# Deleting Attribute (Columns) from df3 dataframe

In [46]:
df5=df3.drop(columns=["DM"])

In [47]:
df5

   CD  DBMS  DSS  CAO
0  19    18   20   26
1  19    18   20   26
2  19    18   20   26
3  19    18   20   26

In [50]:
print("Mean of DSS:",df5["DSS"].mean())

Mean of DSS: 20.0

In [51]:
print("Mean of DSS:",df5["DSS"].median())

Mean of DSS: 20.0

In [52]:
print("Mean of DSS:",df5["DSS"].mode())

Mean of DSS: 0    20
Name: DSS, dtype: int64

# Conclusion:

In this experiment, I have explored the basics of DataFrames by creating Series and DataFrames, adding records and attributes, and performing deletion operations. This helped in understanding the structure and dynamic manipulation capabilities of pandas DataFrames.